#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
tfe_workspace.iac_ws["iac-azure-resources"]: Refreshing state... [id=ws-zj7feQucod5mRUag]
module.ansible_roles["ansible-role-zsh"].github_repository.repo: Refreshing state... [id=ansible-role-zsh]
module.ansible_roles["ansible-role-docker"].github_repository.repo: Refreshing state... [id=ansible-role-docker]
module.ansible_control.github_repository.repo: Refreshing state... [id=ansible-control]
module.ansible_roles["ansible-role-k8s-certificates"].github_repository.repo: Refreshing state... [id=ansible-role-k8s-certificates]
module.ansible_roles["ansible-role-vagrant"].github_repository.repo: Refreshing state... [id=ansible-role-vagrant]
module.terraform_module_repos["terraform-module-scaffolding"].github_repository.repo: Refreshing state... [id=terraform-module-scaffolding]
module.ansible_roles["ansible-role-cryptominer"].github_repository.repo: Refreshing state... [id=ansible-role-cryptominer]
module.iac_github_mgmt.github_repository.repo: Refreshing state... [id=iac-github-mgmt]
module.ansible_roles["ansible-role-k8s-node"].github_repository.repo: Refreshing state... [id=ansible-role-k8s-node]
module.ansible_roles["ansible-role-terraform"].github_repository.repo: Refreshing state... [id=ansible-role-terraform]
github_user_ssh_key.ssh_key_cultclassik: Refreshing state... [id=54706683]
module.azdo_terraform_pipeline_templates.github_repository.repo: Refreshing state... [id=azdo-terraform-pipeline-templates]
module.iac_repos["iac-azure-resources"].github_repository.repo: Refreshing state... [id=iac-azure-resources]
github_actions_secret.tf_api_token["iac-azure-resources"]: Refreshing state... [id=iac-azure-resources:TF_API_TOKEN]
github_actions_secret.tf_api_token["terraform-module-scaffolding"]: Refreshing state... [id=terraform-module-scaffolding:TF_API_TOKEN]
github_user_ssh_key.ssh_key_ansible: Refreshing state... [id=57866186]
module.diehlabs_terraform_module_repos["terraform-azurerm-o365dns"].github_repository.repo: Refreshing state... [id=terraform-azurerm-o365dns]
module.diehlabs_ansible_roles["ansible-role-kubetools"].github_repository.repo: Refreshing state... [id=ansible-role-kubetools]
module.diehlabs_ansible_roles["ansible-role-terraform"].github_repository.repo: Refreshing state... [id=ansible-role-terraform]
module.diehlabs_ansible_roles["ansible-role-git"].github_repository.repo: Refreshing state... [id=ansible-role-git]
module.github_action_templates.github_repository.repo: Refreshing state... [id=.github]
module.terraform_module_repos["terraform-module-scaffolding"].github_branch_default.default: Refreshing state... [id=terraform-module-scaffolding]
module.diehlabs_terraform_module_repos["terraform-azurerm-o365dns"].github_branch_default.default: Refreshing state... [id=terraform-azurerm-o365dns]
module.ansible_control.github_branch_default.default: Refreshing state... [id=ansible-control]
module.github_action_templates.github_branch_default.default: Refreshing state... [id=.github]
tfe_workspace.iac_github_mgmt: Refreshing state... [id=ws-MyypkggTqKQ9xbSY]
github_actions_secret.iac_github_mgmt_tftoken: Refreshing state... [id=iac-github-mgmt:TF_API_TOKEN]
module.diehlabs_ansible_roles["ansible-role-terraform"].github_branch_default.default: Refreshing state... [id=ansible-role-terraform]
module.diehlabs_ansible_roles["ansible-role-git"].github_branch_default.default: Refreshing state... [id=ansible-role-git]
module.diehlabs_ansible_roles["ansible-role-kubetools"].github_branch_default.default: Refreshing state... [id=ansible-role-kubetools]
module.ansible_roles["ansible-role-docker"].github_branch_default.default: Refreshing state... [id=ansible-role-docker]
module.ansible_roles["ansible-role-k8s-certificates"].github_branch_default.default: Refreshing state... [id=ansible-role-k8s-certificates]
module.ansible_roles["ansible-role-cryptominer"].github_branch_default.default: Refreshing state... [id=ansible-role-cryptominer]
module.ansible_roles["ansible-role-k8s-node"].github_branch_default.default: Refreshing state... [id=ansible-role-k8s-node]
module.ansible_roles["ansible-role-terraform"].github_branch_default.default: Refreshing state... [id=ansible-role-terraform]
module.ansible_roles["ansible-role-vagrant"].github_branch_default.default: Refreshing state... [id=ansible-role-vagrant]
module.ansible_roles["ansible-role-zsh"].github_branch_default.default: Refreshing state... [id=ansible-role-zsh]
module.azdo_terraform_pipeline_templates.github_branch_default.default: Refreshing state... [id=azdo-terraform-pipeline-templates]
module.iac_repos["iac-azure-resources"].github_branch_default.default: Refreshing state... [id=iac-azure-resources]
module.iac_github_mgmt.github_branch_default.default: Refreshing state... [id=iac-github-mgmt]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.diehlabs_ansible_roles["ansible-role-kubetools"].github_repository.repo has been changed
  ~ resource "github_repository" "repo" {
      ~ etag                   = "W/\"55ae9e5d01441e593a9ecfd037246268fff0bb817b901d3ebdb8d9fe34d2a26b\"" -> "W/\"15d028b2a8749e4786bc70f2bf3225fe0b32e02674f9553d2e0315e230408b08\""
        id                     = "ansible-role-kubetools"
        name                   = "ansible-role-kubetools"
      + topics                 = []
        # (24 unchanged attributes hidden)
    }
  # module.iac_github_mgmt.github_repository.repo has been changed
  ~ resource "github_repository" "repo" {
      ~ etag                   = "W/\"64876e1ff74cf68e34dddf7217bdb4c81715b834b5b21c7a8f9d327f7e4ce137\"" -> "W/\"445e9d1d149d905dd9c414f162584729b08e006e9b4193694b38f39e2812fcd1\""
        id                     = "iac-github-mgmt"
        name                   = "iac-github-mgmt"
        # (25 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.ansible_roles["ansible-role-docker"].github_branch_default.default will be destroyed
  - resource "github_branch_default" "default" {
      - branch     = "main" -> null
      - id         = "ansible-role-docker" -> null
      - repository = "ansible-role-docker" -> null
    }

  # module.ansible_roles["ansible-role-docker"].github_repository.repo will be destroyed
  - resource "github_repository" "repo" {
      - allow_merge_commit     = true -> null
      - allow_rebase_merge     = true -> null
      - allow_squash_merge     = true -> null
      - archived               = false -> null
      - auto_init              = true -> null
      - default_branch         = "main" -> null
      - delete_branch_on_merge = false -> null
      - description            = "Ansible role for managing Docker - Repo managed by Terraform" -> null
      - etag                   = "W/\"9d224b4443eef191bfc229821e1a536679d3a618ee2ef5a71bcff997edf885e3\"" -> null
      - full_name              = "CultClassik/ansible-role-docker" -> null
      - git_clone_url          = "git://github.com/CultClassik/ansible-role-docker.git" -> null
      - has_downloads          = false -> null
      - has_issues             = false -> null
      - has_projects           = false -> null
      - has_wiki               = false -> null
      - html_url               = "https://github.com/CultClassik/ansible-role-docker" -> null
      - http_clone_url         = "https://github.com/CultClassik/ansible-role-docker.git" -> null
      - id                     = "ansible-role-docker" -> null
      - is_template            = false -> null
      - name                   = "ansible-role-docker" -> null
      - node_id                = "MDEwOlJlcG9zaXRvcnkyNzI0Njc4NDE=" -> null
      - private                = false -> null
      - repo_id                = 272467841 -> null
      - ssh_clone_url          = "git@github.com:CultClassik/ansible-role-docker.git" -> null
      - svn_url                = "https://github.com/CultClassik/ansible-role-docker" -> null
      - topics                 = [] -> null
      - visibility             = "public" -> null
      - vulnerability_alerts   = false -> null
    }

  # module.diehlabs_ansible_roles["ansible-role-docker"].data.github_branch.main will be read during apply
  # (config refers to values not yet known)
 <= data "github_branch" "main"  {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + ref        = (known after apply)
      + repository = "ansible-role-docker"
      + sha        = (known after apply)
    }

  # module.diehlabs_ansible_roles["ansible-role-docker"].github_branch_default.default will be created
  + resource "github_branch_default" "default" {
      + branch     = "main"
      + id         = (known after apply)
      + repository = "ansible-role-docker"
    }

  # module.diehlabs_ansible_roles["ansible-role-docker"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = true
      + default_branch         = (known after apply)
      + delete_branch_on_merge = false
      + description            = "Ansible role for managing Docker - Repo managed by Terraform"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "ansible-role-docker"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @CultClassik, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Configuration Run`*